# LabelLineLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..LabelLineLength Property
Viewport Class See Also
---
The length of the viewport label line in sheet space, measured in feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double LabelLineLength { get; set; }
```

Visual Basic
---
```text
Public Property LabelLineLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LabelLineLength {
	double get ();
	void set (double value);
}
```

# Remarks
It can be negative. The sign depends on the direction of the label line.
# See Also
Viewport Class
Autodesk.Revit.DB Namespace